from django import template

register = template.Library()

# Расписание занятий
SCHEDULE = {
    "1": {"day": "Понедельник", "time": "8:00 - 10:00"},
    "2": {"day": "Понедельник", "time": "10:15 - 12:15"},
    "3": {"day": "Понедельник", "time": "12:30 - 14:00"},
    "4": {"day": "Понедельник", "time": "14:15 - 16:00"},
    "5": {"day": "Вторник", "time": "8:00 - 10:00"},
    "6": {"day": "Вторник", "time": "10:15 - 12:15"},
    "7": {"day": "Вторник", "time": "14:15 - 16:00"},
    "8": {"day": "Вторник", "time": "16:15 - 18:00"},
    "9": {"day": "Среда", "time": "8:00 - 10:00"},
    "10": {"day": "Среда", "time": "10:15 - 12:15"},
    "11": {"day": "Среда", "time": "12:30 - 14:00"},
    "12": {"day": "Среда", "time": "14:15 - 16:00"},
    "13": {"day": "Четверг", "time": "8:00 - 10:00"},
    "14": {"day": "Четверг", "time": "10:15 - 12:15"},
    "15": {"day": "Четверг", "time": "12:30 - 14:00"},
    "16": {"day": "Четверг", "time": "14:15 - 16:00"},
    "17": {"day": "Пятница", "time": "8:00 - 10:00"},
    "18": {"day": "Пятница", "time": "10:15 - 12:15"},
    "19": {"day": "Пятница", "time": "12:30 - 14:00"},
    "20": {"day": "Пятница", "time": "14:15 - 16:00"},
    "21": {"day": "Суббота", "time": "8:00 - 10:00"},
    "22": {"day": "Суббота", "time": "10:15 - 12:15"},
    "23": {"day": "Суббота", "time": "12:30 - 14:00"},
    "24": {"day": "Суббота", "time": "14:15 - 16:00"},
}

@register.filter(name="time_to_schedule")
def time_to_schedule(time_value):
    return SCHEDULE.get(str(time_value), {"day": "Не указано", "time": "Не указано"})



@register.filter(name='split')
def split(value, delimiter):
    return value.split(delimiter)